In [1]:
import numpy as np
from pandas_datareader import data as wb
import matplotlib.pyplot as plt

In [7]:
AMZN = wb.DataReader('AMZN', data_source='yahoo', start='2005-1-1')

In [8]:
AMZN.head()

                 Open       High        Low      Close  Adj Close    Volume
Date
2005-01-03  44.950001  45.439999  44.209999  44.520000  44.520000  10446500
2005-01-04  42.669998  43.259998  41.500000  42.139999  42.139999  19418500
2005-01-05  41.570000  42.759998  41.560001  41.770000  41.770000   8354200
2005-01-06  41.810001  42.250000  40.900002  41.049999  41.049999   8700900
2005-01-07  41.380001  42.689999  41.160000  42.320000  42.320000   9836600

In [9]:
AMZN.tail()

,Open,High,Low,Close,Adj Close,Volume
Date,,,,,,
2018-01-22,1297.170044,1327.449951,1296.660034,1327.310059,1327.310059,4140100
2018-01-23,1338.089966,1364.900024,1337.339966,1362.540039,1362.540039,5169300
2018-01-24,1374.819946,1388.160034,1338.000000,1357.510010,1357.510010,6807500
2018-01-25,1368.000000,1378.339966,1357.619995,1377.949951,1377.949951,4659300
2018-01-26,1392.010010,1400.060059,1380.910034,1398.819946,1398.819946,2999175

In [10]:
AMZN['Simple_Return']= (AMZN['Adj Close'] / AMZN['Adj Close'].shift(1)) - 1

In [11]:
print AMZN['Simple_Return']

Date
2005-01-03         NaN
2005-01-04   -0.053459
2005-01-05   -0.008780
2005-01-06   -0.017237
2005-01-07    0.030938
2005-01-10   -0.011342
2005-01-11   -0.004780
2005-01-12    0.015850
2005-01-13    0.007092
2005-01-14    0.045775
2005-01-18    0.000673
2005-01-19   -0.013908
2005-01-20   -0.036397
2005-01-21   -0.028329
2005-01-24   -0.018950
2005-01-25    0.013868
2005-01-26    0.009770
2005-01-27    0.023464
2005-01-28   -0.002127
2005-01-31    0.023685
2005-02-01   -0.017122
2005-02-02   -0.014124
2005-02-03   -0.146371
2005-02-04   -0.000839
2005-02-07   -0.000840
2005-02-08    0.017092
2005-02-09   -0.011295
2005-02-10   -0.003065
2005-02-11    0.000000
2005-02-14    0.006987
                ...
2017-12-13   -0.000815
2017-12-14    0.008702
2017-12-15    0.004156
2017-12-18    0.009702
2017-12-19   -0.002688
2017-12-20   -0.008220
2017-12-21   -0.002429
2017-12-22   -0.005448
2017-12-26    0.007190
2017-12-27    0.004674
2017-12-28    0.003248
2017-12-29   -0.014021
2018-01-02    0.016708
2018-01-03    0.012775
2018-01-04    0.004476
2018-01-05    0.016163
2018-01-08    0.014425
2018-01-09    0.004676
2018-01-10    0.001301
2018-01-11    0.017818
2018-01-12    0.022339
2018-01-16   -0.000260
2018-01-17   -0.007556
2018-01-18   -0.001297
2018-01-19    0.000974
2018-01-22    0.025282
2018-01-23    0.026542
2018-01-24   -0.003692
2018-01-25    0.015057
2018-01-26    0.015146
Name: Simple_Return, Length: 3290, dtype: float64

In [17]:
print x

1

In [28]:
def summation(num):
    cntr = 1
    sum = 1
    while cntr < num:
        sum = sum + cntr
        print "cntr: ", cntr
        print "sum:", sum
        cntr += 1
    print "Submitted value:", num
    print "Summation:", sum

In [29]:
summation(8)

cntr:  1
sum: 2
cntr:  2
sum: 4
cntr:  3
sum: 7
cntr:  4
sum: 11
cntr:  5
sum: 16
cntr:  6
sum: 22
cntr:  7
sum: 29
Submitted value: 8
Summation: 29

In [46]:
def summation(num):
    print num * ( num + 1 ) / 2

In [53]:
summation(8)

36

In [58]:
def bool_to_word(bool):
    if bool == True:
        print "Yes"
    else:
        print "No"

In [60]:
bool_to_word(False)

No